{
    "Text": [
        {
            "page": "General Tips",
            "desc": "These are more general tips I have for school and life in general."
        }
    ],
    "GeneralTips": [
        {
            "id": 1,
            "underlined": "Just get started",
            "tip": "No matter what I'm working on, it always seems like the hardest part of it is getting started. I find that I sometimes procrastinate when I find a task daunting or think it will be challenging. It's never as bad it seems once you get started and get into the flow of things. Just try your best to start working on what you find difficult and it's usually not nearly as hard as you think it will be."
        },
        {
            "id": 2,
            "underlined": "The 5 second rule",
            "tip": "This is kind of adding the first point, learn the 5 second rule. Whenever you have something to do and are procrastinating, don't just sit there and ponder about it. Start counting down from 5 and when you get to 1, make a decision about what you're going to do. For example, say I've been scrolling on Instagram for a while and have work to do. I'd start counting down from 5 and once I get to 1 I'll decide if I should keep scrolling or go do something more productive. It works basically everytime."
        },
        {
            "id": 3,
            "underlined": "Send in your high school AP scores",
            "tip": "If you haven't done so already, I'd recommend sending in your high school AP scores. They can get you college credit which can be beneficial for many reasons. The credit can help you graduate early, get out of classes you don't want to take, give you more time to take classes you do want to take, etc."
        },
        {
            "id": 4,
            "underlined": "",
            "tip": "FILL THIS IN"
        },
        {
            "id": 5,
            "underlined": "Imposter syndrome is normal",
            "tip": "It's normal to think that everyone knows more than you, or is more experienced than you. Don't be afraid to ask for help or feel lesser of yourself. People will typically be happy to help you learn."
        },
        {
            "id": 6,
            "underlined": "",
            "tip": "FILL THIS IN"
        },
        {
            "id": 7,
            "underlined": "Buy a cable adapter",
            "tip": "Whenever I had to give a presentation in college it always seemed like people were missing a cable to hookup their computer to the smartboard. I think cable adapters are a great thing to have to charge multiple devices at once, hookup to smartboard, etc. I'd recommend buying this [one](https://www.amazon.com/CableCreation-Multiport-Adapter-Ethernet-MacBook/dp/B0967WZBGZ/ref=sr_1_3?crid=2DSU62TGAGHU2&dib=eyJ2IjoiMSJ9.mydca7xUkG-uDUmqlIqEKf5-eykgN8B32RHE6zvffSt-n1Q1gsxNRMSLWmXX0tIwuqs4wyFMltMvUkR3it6uOjnS-JBWkqKCP9M9-jYrye4DXLdae1lOZdVROJBCtmm_qSulrcia_8JITKkL4Ha_2quxrv_Tq9tQWlcO8TgUyC63s8XKYUUv_NlYG1snGL8Zv5kBP1a9cetXYrXkd-o4Jokn-QfaK8V1IgoRMsqIz20.bP7YdhW1HPf8-tPns14lH5EMgx7B2qYNSWTyxitpPXs&dib_tag=se&keywords=cablecreation&qid=1713744859&sprefix=CableCreat%2Caps%2C106&sr=8-3&th=1) that you can buy from your older brothers company Amazon. It's a little pricey but definitely worth it imo. Just make sure to buy one that actually works for your computer."
        },
        {
            "id": 8,
            "underlined": "",
            "tip": "FILL THIS IN"
        },
        {
            "id": 9,
            "underlined": "",
            "tip": "FILL THIS IN"
        },
        {
            "id": 10,
            "underlined": "",
            "tip": "FILL THIS IN"
        },
        {
            "id": 11,
            "underlined": "",
            "tip": "FILL THIS IN"
        },
        {
            "id": 12,
            "underlined": "",
            "tip": "FILL THIS IN"
        },
        {
            "id": 13,
            "underlined": "",
            "tip": "FILL THIS IN"
        },
        {
            "id": 14,
            "underlined": "",
            "tip": "FILL THIS IN"
        },
        {
            "id": 15,
            "underlined": "Try Greyhound buses",
            "tip": "This is a relatively affordable way to get from Wilmington to Charlotte if you don't have a car."
        },
        {
            "id": 16,
            "underlined": "Follow Lil Goof Ball on TikTok",
            "tip": "This guy went to UNCW and I think his TikTok is pretty funny. You can follow him [here](https://www.tiktok.com/@lilgoofball). Also, he's on campus pretty frequently, so keep an eye out for him if you want."
        },
        {
            "id": 17,
            "underlined": "",
            "tip": "FILL THIS IN"
        },
        {
            "id": 18,
            "underlined": "",
            "tip": "FILL THIS IN"
        }
    ]
}